# 直接赋值：两个变量指向同一个对象，修改其中一个，就会影响另一个（互相影响）
# nums1 = [10,20,30]
# nums2 = nums1
# nums1[0] = 100
# 输出结果：[100, 20, 30]
# print(nums2)
import copy

# 潜拷贝：创建一个新的外层容器，但内部元素仍然引用原来的对象
# import copy
# nums1 = [10,20,30,40]
# nums2 = copy.copy(nums1)
# nums2[0] = 100
# # 输出结果：[10, 20, 30, 40]
# print(nums1)
# # 输出结果：[100, 20, 30, 40]
# print(nums2)

# 缺点：嵌套数据仍然是共享的，修改嵌套数据会相互影响，嵌套数据还是共享一个地址
# nums1 = [10,20,30,[1,3]]
# nums2 = copy.copy(nums1)
# nums1[3][0] = 100
# 输出结果：[10, 20, 30, [100, 3]]
# print(nums2)


# 深拷贝：创建一个新的外层容器，并对其内部所有的可变对象进行递归复制
# 1.深拷贝可以彻底消除数据之间的相互影响
# 2.深拷贝遇到[不可变对象]不会复制，会直接引用
nums1 = [[1,2],100,200]
nums2 = copy.deepcopy(nums1)
nums1[0][0] = 2
# 输出结果：[[1, 2], 100, 200]
print(nums2)