# 查询
d1 = {'张三':72,'李四':60}
# 直接取值，若key不存在，会报错
# 输出结果：72
print(d1['张三'])
# 安全取值，若key不存在，会返回默认值（没有设置默认值，就会返回None）
# 输出结果：72
print(d1.get('张三'))
# 输出结果：key不存在
print(d1.get('奥特曼','key不存在'))

# 新增
d2 = {'张三':72,'李四':60}
d2['赵六'] = 22
# 输出结果：{'张三': 72, '李四': 60, '赵六': 22}
print(d2)

# 修改
# 修改的写法和新增一样
d2['张三'] = 88
# 输出结果：{'张三': 88, '李四': 60, '赵六': 22}
print(d2)

# 批量修改
d2.update({'张三':12,'小明':33})
# 输出结果：{'张三': 12, '李四': 60, '赵六': 22, '小明': 33}
print(d2)

# 删除
# del 集合[key]，不存在会报错
# 输出结果：{'李四': 60, '赵六': 22, '小明': 33}
del d2['张三']
print(d2)
# 不存在会报错
# del d2['小红']
# pop方法：删除指定key和其value，并返回value。不存在会报错，设置默认值就不会报错了
# 报错
# d2.pop('小红')
re = d2.pop('小红','母鸡')
# 输出结果：母鸡
print(re)

# 输出结果：{'李四': 60, '赵六': 22, '小明': 33}
print(d2)
d2.clear()
# 输出结果：{}
print(d2)